# Parameter Type Id Rbs Elec Circuit Cable Type Param Property

Source: https://www.revitapidocs.com/2026/92e2fcc3-e566-7780-c450-fa489a741cfa.htm

---

| Parameter Type Id Rbs Elec Circuit Cable Type Param Property |
| --- |

"Cable Type"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RbsElecCircuitCableTypeParam { get; }
```

```
Public Shared ReadOnly Property RbsElecCircuitCableTypeParam As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RbsElecCircuitCableTypeParam {
	ForgeTypeId^ get ();
}
```

```
static member RbsElecCircuitCableTypeParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace